<template>
  <div class="select">
	<p :style="style" v-html="texts[index-1]"></p>
	<p :style="style" v-html="texts[index-1]"></p>
	<p :style="style" v-html="texts[index-1]"></p>
	<p :style="style" v-html="texts[index-1]"></p>
	<p :style="style" v-html="texts[index-1]"></p>
	<p :style="style" v-html="texts[index-1]"></p>
  </div>
</template>

<script>
export default {
    name: "select",
    props: {
        color: {
            type: String,
            required: true
        },
        index: {
            type: Number,
            require: true
        }

    },
    computed:{
        style() {
            return 'color: '+this.color;
        }
    },
    data() {
        return{
            texts : {               
                24:{
                    q: `Q1. 고민이 많아 보이는 회색인간.<br/> 그는 어떤 고민을 하고 있을까요?`,
                    r: '사랑에 대한 고민',
                    y: '꿈과 진로에 대한 고민',
                    g: '가족, 친구등 관계에 대한 고민',
                    b: '경제적 상황에 대한 고민',
                    p: '삶과 죽음에 대한 고민',
                },
                26:{
                    q: `Q2. 회색인간에게 위로의 말을<br/> 
건네고 싶은 당신. <br/>
어떤 위로의 말을 해주면 좋을까요?`,
                    r: `힘내! 다 잘될거야! <br/>
긍정적으로 생각해보자!`,
                    y: `시간이 지나면 <br/>
 괜찮아질거야`,
                    g: ` 울고 싶으면 내 어깨에 
기대어 울어도 좋아`,
                    b: `숨을 깊게 들이마시면 
기분이 좋아진대. 
같이 해보지 않을래? `,
                    p: `당신이 힘들때
 위로가 되었던 시 구절을 
찾아 읽어준다`,
                },
                28:{
                    q: `Q3. 회색인간과 기차에서 내린 당신.
 눈 앞에 어떠한 풍경이
 펼쳐져 있을까요?`,
                    r: `살랑이는 바람에 풀들이 춤추는 초원`,
                    y: `광활하게 펼쳐진 하늘과 바다`,
                    g: `별빛 가득한 은하수`,
                    b: `깎아지른 듯 높이 솟아오른 산 `,
                    p: `노을지는 하늘을 배경으로 한 구름 위`,
                },
                32:{
                    q: `Q4. 조금 걷다보니
 어스름한 안개 너머로 문 하나가
 눈 앞에 들어옵니다. 
문은 어떤 모습일까요??
`,
                    r: `화려한 곡선이 눈에 띄는 
세련된 문양의 문`,
                    y: `둥근 지붕이 귀여운 느낌을 주는 
아늑한 느낌의 문`,
                    g: `널찍한 크기를 자랑하는
 시원한 느낌의 문`,
                    b: `담쟁이덩굴과 꽃으로 
뒤덮인 유서 깊은 문`,
                    p: `숨겨진 비밀이 있을 것만
 같은 높고 뾰족한 문`,
                },
                34:{
                    q: `Q5.  그때, 노랫소리가 들려옵니다. 
어떤 노래일까요?
`,
                    r: `경쾌한 느낌의 팝`,
                    y: `평화로운 피아노 선율`,
                    g: `귀에 꽂히는 강렬한 펑크 락`,
                    b: `고풍스러운 클래식`,
                    p: `리드미컬한 재즈`,
                },
                36:{
                    q: `Q6. 가장 탐스러워 보이는
 열매를 따서 먹어봅니다.
 열매는 어떤 맛일까요?`,
                    r: `화끈한 맛`,
                    y: `새콤달콤한 맛`,
                    g: `밍밍한 맛`,
                    b: `달달한 맛`,
                    p: `떫은 맛`,
                },
                38:{
                    q: `Q7. 갑자기 회색인간과 
호수에 뛰어든 당신.
 피부에 닿는 호수물은 
어떤 느낌일까요?`,
                    r: `솜사탕처럼 몽글몽글한 느낌`,
                    y: `비단처럼 한없이 부드러운 느낌`,
                    g: `유리구슬처럼 단단하고 시원한 느낌`,
                    b: `젤리처럼 응고력이 강한 액체 느낌`,
                    p: `공기처럼 가벼운 느낌`,
                },
                40:{
                    q: `Q8.  별빛들은 어떤 향기가 날까요?`,
                    r: `장미 사탕처럼 달콤한 향`,
                    y: `짙은 숲 속의 상쾌한 향`,
                    g: `시나몬 느낌의 부드러운 향`,
                    b: `박하, 후추처럼 코가 톡쏘는 강렬한 향`,
                    p: `은은하게 전해오는  씁쓸한 향`,
                },
                45:{
                    q: `Q9. 이 말을 들은 당신은
어떤 대답을 할까요 ?`,
                    r: `회색인간을 와락 끌어안는다.`,
                    y: `언젠가 꼭 다시 만나자고 약속한다`,
                    g: `회색인간과의 마지막을
 기억하기 위해 함께 사진을 찍는다.`,
                    b: `회색인간의 손을 꼭 잡고
 눈을 맞추며 당신도 고맙다고 말한다`,
                    p: `회색인간의 손바닥에
당신의 연락처를 적어준다.
`,
                }
            }
        }
    }
}
</script>

<style>
.ts {

}


</style>